//  Дано число обозначающее день недели. Выяснить является номер дня недели выходным
Console.Write("введите имя! ");
string username = Console.ReadLine();
Console.Write("привет, ");
Console.Write(username);


