/*Напишите программу, которая будет преобразовывать десятичное число в двоичное.*/ 

// int x = 32;
// string bin = Convert.ToString(x,2);
// Console.WriteLine(bin);


Console.WriteLine("Введите число :");

int digit = Convert.ToInt32(Console.ReadLine());

string
